STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp253fxx_ca35.h
/*******************  Bits definition for RTC_CFGR register  ******************/
#define RTC_CFGR_OUT2_RMP_Pos        (0U)
#define RTC_CFGR_OUT2_RMP_Msk        (0x1UL << RTC_CFGR_OUT2_RMP_Pos)                    /*!< 0x00000001 */
#define RTC_CFGR_OUT2_RMP            RTC_CFGR_OUT2_RMP_Msk

/********************  Bits definition for RTC_ALRABINR register  ******************/
#define RTC_ALRABINR_SS_Pos          (0U)
#define RTC_ALRABINR_SS_Msk          (0xFFFFFFFFUL << RTC_ALRABINR_SS_Pos)              /*!< 0xFFFFFFFF */
#define RTC_ALRABINR_SS              RTC_ALRABINR_SS_Msk

/********************  Bits definition for RTC_ALRBBINR register  ******************/
#define RTC_ALRBBINR_SS_Pos          (0U)
#define RTC_ALRBBINR_SS_Msk          (0xFFFFFFFFUL << RTC_ALRBBINR_SS_Pos)              /*!< 0xFFFFFFFF */
#define RTC_ALRBBINR_SS              RTC_ALRBBINR_SS_Msk

/********************  Bits definition for RTC_RCIDCFGR register  ******************/
#define RTC_RCIDCFGR_CFEN_Pos          (0U)
#define RTC_RCIDCFGR_CFEN_Msk          (0x1UL << RTC_RCIDCFGR_CFEN_Pos)                 /*!< 0xFFFFFFFF */
#define RTC_RCIDCFGR_CFEN              RTC_RCIDCFGR_CFEN_Msk
#define RTC_RCIDCFGR_CID_Pos           (4U)
#define RTC_RCIDCFGR_CID_Msk           (0xFUL << RTC_RCIDCFGR_CID_Pos)                  /*!< 0x000000F0 */
#define RTC_RCIDCFGR_CID               RTC_RCIDCFGR_CID_Msk

/********************  Bits definition for RTC_HWCFGR register  ******************/
#define RTC_HWCFGR_ALARMB_Pos          (0U)
#define RTC_HWCFGR_ALARMB_Msk          (0xFUL << RTC_HWCFGR_ALARMB_Pos)                 /*!< 0x0000000F */
#define RTC_HWCFGR_ALARMB              RTC_HWCFGR_ALARMB_Msk
#define RTC_HWCFGR_WAKEUP_Pos          (4U)
#define RTC_HWCFGR_WAKEUP_Msk          (0xFUL << RTC_HWCFGR_WAKEUP_Pos)                 /*!< 0x000000F0 */
#define RTC_HWCFGR_WAKEUP              RTC_HWCFGR_WAKEUP_Msk
#define RTC_HWCFGR_SMOOTH_CALIB_Pos    (8U)
#define RTC_HWCFGR_SMOOTH_CALIB_Msk    (0xFUL << RTC_HWCFGR_SMOOTH_CALIB_Pos)           /*!< 0x00000F00 */
#define RTC_HWCFGR_SMOOTH_CALIB        RTC_HWCFGR_SMOOTH_CALIB_Msk
#define RTC_HWCFGR_TIMESTAMP_Pos       (12U)
#define RTC_HWCFGR_TIMESTAMP_Msk       (0xFUL << RTC_HWCFGR_TIMESTAMP_Pos)              /*!< 0x00000F000 */
#define RTC_HWCFGR_TIMESTAMP           RTC_HWCFGR_TIMESTAMP_Msk
#define RTC_HWCFGR_OPTIONREG_OUT_Pos   (16U)
#define RTC_HWCFGR_OPTIONREG_OUT_Msk   (0xFFUL << RTC_HWCFGR_OPTIONREG_OUT_Pos)         /*!< 0x00FF0000 */
#define RTC_HWCFGR_OPTIONREG_OUT       RTC_HWCFGR_OPTIONREG_OUT_Msk
#define RTC_HWCFGR_TRUST_ZONE_Pos      (24U)
#define RTC_HWCFGR_TRUST_ZONE_Msk      (0xFUL << RTC_HWCFGR_TRUST_ZONE_Pos)             /*!< 0x0F000000 */
#define RTC_HWCFGR_TRUST_ZONE          RTC_HWCFGR_TRUST_ZONE_Msk
#define RTC_HWCFGR_RIF_Pos             (24U)
#define RTC_HWCFGR_RIF_Msk             (0xFUL << RTC_HWCFGR_RIF_Pos)                    /*!< 0xF0000000 */
#define RTC_HWCFGR_RIF                 RTC_HWCFGR_RIF_Msk

/*******************  Bits definition for RTC_VERR register  **************/
#define RTC_VERR_MINREV_Pos            (0U)
#define RTC_VERR_MINREV_Msk            (0x4UL << RTC_VERR_MINREV_Pos)                   /*!< 0x0000000F */
#define RTC_VERR_MINREV                RTC_VERR_MINREV_Msk                              /*!< RTC Minor version */
#define RTC_VERR_MAJREV_Pos            (4U)
#define RTC_VERR_MAJREV_Msk            (0x4UL << RTC_VERR_MAJREV_Pos)                   /*!< 0x000000F0 */
#define RTC_VERR_MAJREV                RTC_VERR_MAJREV_Msk                              /*!< RTC Major version */

/*******************  Bits definition for RTC_IPIDR register  **************/
#define RTC_IPIDR_ID_Pos               (0U)
#define RTC_IPIDR_ID_Msk               (0xFFFFFFFFUL << RTC_IPIDR_ID_Pos)               /*!< 0xFFFFFFFF */
#define RTC_IPIDR_ID                   RTC_IPIDR_ID_Msk                                 /*!< RTC ID */

/*******************  Bits definition for RTC_SIDR register  **************/
#define RTC_SIDR_SID_Pos               (0U)
#define RTC_SIDR_SID_Msk               (0xFFFFFFFFUL << RTC_SIDR_SID_Pos)               /*!< 0xFFFFFFFF */
#define RTC_SIDR_SID                   RTC_SIDR_SID_Msk                                 /*!< RTC Size ID */

/******************************************************************************/
/*                                                                            */
/*               Secure Advanced Encryption Standard (SAES)                   */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for SAES_CR register  *********************/
#define SAES_CR_EN_Pos                      (0U)
#define SAES_CR_EN_Msk                      (0x1UL << SAES_CR_EN_Pos)               /*!< 0x00000001 */
#define SAES_CR_EN                          SAES_CR_EN_Msk                          /*!< SAES Enable */
#define SAES_CR_DATATYPE_Pos                (1U)
#define SAES_CR_DATATYPE_Msk                (0x3UL << SAES_CR_DATATYPE_Pos)         /*!< 0x00000006 */
#define SAES_CR_DATATYPE                    SAES_CR_DATATYPE_Msk                    /*!< Data type selection */
#define SAES_CR_DATATYPE_0                  (0x1UL << SAES_CR_DATATYPE_Pos)         /*!< 0x00000002 */
#define SAES_CR_DATATYPE_1                  (0x2UL << SAES_CR_DATATYPE_Pos)         /*!< 0x00000004 */
#define SAES_CR_MODE_Pos                    (3U)
#define SAES_CR_MODE_Msk                    (0x3UL << SAES_CR_MODE_Pos)             /*!< 0x00000018 */
#define SAES_CR_MODE                        SAES_CR_MODE_Msk                        /*!< SAES Mode Of Operation */
#define SAES_CR_MODE_0                      (0x1UL << SAES_CR_MODE_Pos)             /*!< 0x00000008 */
#define SAES_CR_MODE_1                      (0x2UL << SAES_CR_MODE_Pos)             /*!< 0x00000010 */
#define SAES_CR_CHMOD_Pos                   (5U)
#define SAES_CR_CHMOD_Msk                   (0x803UL << SAES_CR_CHMOD_Pos)          /*!< 0x00010060 */
#define SAES_CR_CHMOD                       SAES_CR_CHMOD_Msk                       /*!< SAES Chaining Mode */
#define SAES_CR_CHMOD_0                     (0x1UL << SAES_CR_CHMOD_Pos)            /*!< 0x00000020 */
#define SAES_CR_CHMOD_1                     (0x2UL << SAES_CR_CHMOD_Pos)            /*!< 0x00000040 */
#define SAES_CR_CHMOD_2                     (0x800UL << SAES_CR_CHMOD_Pos)          /*!< 0x00010000 */
#define SAES_CR_DMAINEN_Pos                 (11U)
#define SAES_CR_DMAINEN_Msk                 (0x1UL << SAES_CR_DMAINEN_Pos)          /*!< 0x00000800 */
#define SAES_CR_DMAINEN                     SAES_CR_DMAINEN_Msk                     /*!< Enable data input phase DMA management  */
#define SAES_CR_DMAOUTEN_Pos                (12U)
#define SAES_CR_DMAOUTEN_Msk                (0x1UL << SAES_CR_DMAOUTEN_Pos)         /*!< 0x00001000 */
#define SAES_CR_DMAOUTEN                    SAES_CR_DMAOUTEN_Msk                    /*!< Enable data output phase DMA management */
#define SAES_CR_GCMPH_Pos                   (13U)
#define SAES_CR_GCMPH_Msk                   (0x3UL << SAES_CR_GCMPH_Pos)            /*!< 0x00006000 */
#define SAES_CR_GCMPH                       SAES_CR_GCMPH_Msk                       /*!< GCM or CCM phase selection */
#define SAES_CR_GCMPH_0                     (0x1UL << SAES_CR_GCMPH_Pos)            /*!< 0x00002000 */
#define SAES_CR_GCMPH_1                     (0x2UL << SAES_CR_GCMPH_Pos)            /*!< 0x00004000 */
#define SAES_CR_KEYSIZE_Pos                 (18U)
#define SAES_CR_KEYSIZE_Msk                 (0x1UL << SAES_CR_KEYSIZE_Pos)          /*!< 0x00040000 */
#define SAES_CR_KEYSIZE                     SAES_CR_KEYSIZE_Msk                     /*!< Key size selection */
#define SAES_CR_KEYPROT_Pos                 (19U)
#define SAES_CR_KEYPROT_Msk                 (0x1UL << SAES_CR_KEYPROT_Pos)          /*!< 0x00080000 */
#define SAES_CR_KEYPROT                     SAES_CR_KEYPROT_Msk                     /*!< Key protection */
#define SAES_CR_NPBLB_Pos                   (20U)
#define SAES_CR_NPBLB_Msk                   (0xFUL << SAES_CR_NPBLB_Pos)            /*!< 0x00F00000 */
#define SAES_CR_NPBLB                       SAES_CR_NPBLB_Msk                       /*!< Number of padding bytes in last block */
#define SAES_CR_NPBLB_0                     (0x1UL << SAES_CR_NPBLB_Pos)            /*!< 0x00100000 */
#define SAES_CR_NPBLB_1                     (0x2UL << SAES_CR_NPBLB_Pos)            /*!< 0x00200000 */
#define SAES_CR_NPBLB_2                     (0x4UL << SAES_CR_NPBLB_Pos)            /*!< 0x00400000 */
#define SAES_CR_NPBLB_4                     (0x8UL << SAES_CR_NPBLB_Pos)            /*!< 0x00800000 */
#define SAES_CR_KMOD_Pos                    (24U)
#define SAES_CR_KMOD_Msk                    (0x3UL << SAES_CR_KMOD_Pos)             /*!< 0x03000000 */
#define SAES_CR_KMOD                        SAES_CR_KMOD_Msk                        /*!< Key mode selection */
#define SAES_CR_KMOD_0                      (0x1UL << SAES_CR_KMOD_Pos)             /*!< 0x01000000 */
#define SAES_CR_KMOD_1                      (0x2UL << SAES_CR_KMOD_Pos)             /*!< 0x02000000 */
#define SAES_CR_KSHAREID_Pos                (26U)
#define SAES_CR_KSHAREID_Msk                (0x3UL << SAES_CR_KSHAREID_Pos)         /*!< 0x0C000000 */
#define SAES_CR_KSHAREID                    SAES_CR_KSHAREID_Msk                    /*!< Key Shared ID */
#define SAES_CR_KSHAREID_0                  (0x1UL << SAES_CR_KSHAREID_Pos)         /*!< 0x04000000 */
#define SAES_CR_KSHAREID_1                  (0x2UL << SAES_CR_KSHAREID_Pos)         /*!< 0x08000000 */
#define SAES_CR_KEYSEL_Pos                  (28U)
#define SAES_CR_KEYSEL_Msk                  (0x7UL << SAES_CR_KEYSEL_Pos)           /*!< 0x70000000 */
#define SAES_CR_KEYSEL                      SAES_CR_KEYSEL_Msk                      /*!< Key Selection */
#define SAES_CR_KEYSEL_0                    (0x1UL << SAES_CR_KEYSEL_Pos)           /*!< 0x10000000 */
#define SAES_CR_KEYSEL_1                    (0x2UL << SAES_CR_KEYSEL_Pos)           /*!< 0x20000000 */
#define SAES_CR_KEYSEL_2                    (0x4UL << SAES_CR_KEYSEL_Pos)           /*!< 0x40000000 */
#define SAES_CR_IPRST_Pos                   (31U)
#define SAES_CR_IPRST_Msk                   (0x1UL << SAES_CR_IPRST_Pos)            /*!< 0x80000000 */
#define SAES_CR_IPRST                       SAES_CR_IPRST_Msk                       /*!< SAES IP software reset */

/*******************  Bit definition for SAES_SR register  *********************/
#define SAES_SR_RDERR_Pos                   (1U)
#define SAES_SR_RDERR_Msk                   (0x1UL << SAES_SR_RDERR_Pos)            /*!< 0x00000002 */
#define SAES_SR_RDERR                       SAES_SR_RDERR_Msk                       /*!< Read Error Flag */
#define SAES_SR_WRERR_Pos                   (2U)
#define SAES_SR_WRERR_Msk                   (0x1UL << SAES_SR_WRERR_Pos)            /*!< 0x00000004 */
#define SAES_SR_WRERR                       SAES_SR_WRERR_Msk                       /*!< Write Error Flag */
#define SAES_SR_BUSY_Pos                    (3U)
#define SAES_SR_BUSY_Msk                    (0x1UL << SAES_SR_BUSY_Pos)             /*!< 0x00000008 */
#define SAES_SR_BUSY                        SAES_SR_BUSY_Msk                        /*!< Busy Flag */
#define SAES_SR_KEYVALID_Pos                (7U)
#define SAES_SR_KEYVALID_Msk                (0x1UL << SAES_SR_KEYVALID_Pos)         /*!< 0x00000080 */
#define SAES_SR_KEYVALID                    SAES_SR_KEYVALID_Msk                    /*!< KEYVALID Flag */

