STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp253fxx_ca35.h
/* Bit fields for USB3_GTXFIFOSIZ0 register */
#define USB3_GTXFIFOSIZ0_TXFDEP_N_Pos                            0
#define USB3_GTXFIFOSIZ0_TXFDEP_N_Msk                            (0xffffUL << 0)
#define USB3_GTXFIFOSIZ0_TXFDEP_N                                (0xffffUL << 0)
#define USB3_GTXFIFOSIZ0_TXFSTADDR_N_Pos                         16
#define USB3_GTXFIFOSIZ0_TXFSTADDR_N_Msk                         (0xffffUL << 16)
#define USB3_GTXFIFOSIZ0_TXFSTADDR_N                             (0xffffUL << 16)

/* Bit fields for USB3_GTXFIFOSIZ1 register */
#define USB3_GTXFIFOSIZ1_TXFDEP_N_Pos                            0
#define USB3_GTXFIFOSIZ1_TXFDEP_N_Msk                            (0xffffUL << 0)
#define USB3_GTXFIFOSIZ1_TXFDEP_N                                (0xffffUL << 0)
#define USB3_GTXFIFOSIZ1_TXFSTADDR_N_Pos                         16
#define USB3_GTXFIFOSIZ1_TXFSTADDR_N_Msk                         (0xffffUL << 16)
#define USB3_GTXFIFOSIZ1_TXFSTADDR_N                             (0xffffUL << 16)

/* Bit fields for USB3_GTXFIFOSIZ2 register */
#define USB3_GTXFIFOSIZ2_TXFDEP_N_Pos                            0
#define USB3_GTXFIFOSIZ2_TXFDEP_N_Msk                            (0xffffUL << 0)
#define USB3_GTXFIFOSIZ2_TXFDEP_N                                (0xffffUL << 0)
#define USB3_GTXFIFOSIZ2_TXFSTADDR_N_Pos                         16
#define USB3_GTXFIFOSIZ2_TXFSTADDR_N_Msk                         (0xffffUL << 16)
#define USB3_GTXFIFOSIZ2_TXFSTADDR_N                             (0xffffUL << 16)

/* Bit fields for USB3_GTXFIFOSIZ3 register */
#define USB3_GTXFIFOSIZ3_TXFDEP_N_Pos                            0
#define USB3_GTXFIFOSIZ3_TXFDEP_N_Msk                            (0xffffUL << 0)
#define USB3_GTXFIFOSIZ3_TXFDEP_N                                (0xffffUL << 0)
#define USB3_GTXFIFOSIZ3_TXFSTADDR_N_Pos                         16
#define USB3_GTXFIFOSIZ3_TXFSTADDR_N_Msk                         (0xffffUL << 16)
#define USB3_GTXFIFOSIZ3_TXFSTADDR_N                             (0xffffUL << 16)

/* Bit fields for USB3_GTXFIFOSIZ4 register */
#define USB3_GTXFIFOSIZ4_TXFDEP_N_Pos                            0
#define USB3_GTXFIFOSIZ4_TXFDEP_N_Msk                            (0xffffUL << 0)
#define USB3_GTXFIFOSIZ4_TXFDEP_N                                (0xffffUL << 0)
#define USB3_GTXFIFOSIZ4_TXFSTADDR_N_Pos                         16
#define USB3_GTXFIFOSIZ4_TXFSTADDR_N_Msk                         (0xffffUL << 16)
#define USB3_GTXFIFOSIZ4_TXFSTADDR_N                             (0xffffUL << 16)

/* Bit fields for USB3_GTXFIFOSIZ5 register */
#define USB3_GTXFIFOSIZ5_TXFDEP_N_Pos                            0
#define USB3_GTXFIFOSIZ5_TXFDEP_N_Msk                            (0xffffUL << 0)
#define USB3_GTXFIFOSIZ5_TXFDEP_N                                (0xffffUL << 0)
#define USB3_GTXFIFOSIZ5_TXFSTADDR_N_Pos                         16
#define USB3_GTXFIFOSIZ5_TXFSTADDR_N_Msk                         (0xffffUL << 16)
#define USB3_GTXFIFOSIZ5_TXFSTADDR_N                             (0xffffUL << 16)

/* Bit fields for USB3_GTXFIFOSIZ6 register */
#define USB3_GTXFIFOSIZ6_TXFDEP_N_Pos                            0
#define USB3_GTXFIFOSIZ6_TXFDEP_N_Msk                            (0xffffUL << 0)
#define USB3_GTXFIFOSIZ6_TXFDEP_N                                (0xffffUL << 0)
#define USB3_GTXFIFOSIZ6_TXFSTADDR_N_Pos                         16
#define USB3_GTXFIFOSIZ6_TXFSTADDR_N_Msk                         (0xffffUL << 16)
#define USB3_GTXFIFOSIZ6_TXFSTADDR_N                             (0xffffUL << 16)

/* Bit fields for USB3_GTXFIFOSIZ7 register */
#define USB3_GTXFIFOSIZ7_TXFDEP_N_Pos                            0
#define USB3_GTXFIFOSIZ7_TXFDEP_N_Msk                            (0xffffUL << 0)
#define USB3_GTXFIFOSIZ7_TXFDEP_N                                (0xffffUL << 0)
#define USB3_GTXFIFOSIZ7_TXFSTADDR_N_Pos                         16
#define USB3_GTXFIFOSIZ7_TXFSTADDR_N_Msk                         (0xffffUL << 16)
#define USB3_GTXFIFOSIZ7_TXFSTADDR_N                             (0xffffUL << 16)

/* Bit fields for USB3_GTXFIFOSIZ8 register */
#define USB3_GTXFIFOSIZ8_TXFDEP_N_Pos                            0
#define USB3_GTXFIFOSIZ8_TXFDEP_N_Msk                            (0xffffUL << 0)
#define USB3_GTXFIFOSIZ8_TXFDEP_N                                (0xffffUL << 0)
#define USB3_GTXFIFOSIZ8_TXFSTADDR_N_Pos                         16
#define USB3_GTXFIFOSIZ8_TXFSTADDR_N_Msk                         (0xffffUL << 16)
#define USB3_GTXFIFOSIZ8_TXFSTADDR_N                             (0xffffUL << 16)

/* Bit fields for USB3_GTXFIFOSIZ9 register */
#define USB3_GTXFIFOSIZ9_TXFDEP_N_Pos                            0
#define USB3_GTXFIFOSIZ9_TXFDEP_N_Msk                            (0xffffUL << 0)
#define USB3_GTXFIFOSIZ9_TXFDEP_N                                (0xffffUL << 0)
#define USB3_GTXFIFOSIZ9_TXFSTADDR_N_Pos                         16
#define USB3_GTXFIFOSIZ9_TXFSTADDR_N_Msk                         (0xffffUL << 16)
#define USB3_GTXFIFOSIZ9_TXFSTADDR_N                             (0xffffUL << 16)

/* Bit fields for USB3_GTXFIFOSIZ10 register */
#define USB3_GTXFIFOSIZ10_TXFDEP_N_Pos                           0
#define USB3_GTXFIFOSIZ10_TXFDEP_N_Msk                           (0xffffUL << 0)
#define USB3_GTXFIFOSIZ10_TXFDEP_N                               (0xffffUL << 0)
#define USB3_GTXFIFOSIZ10_TXFSTADDR_N_Pos                        16
#define USB3_GTXFIFOSIZ10_TXFSTADDR_N_Msk                        (0xffffUL << 16)
#define USB3_GTXFIFOSIZ10_TXFSTADDR_N                            (0xffffUL << 16)

/* Bit fields for USB3_GTXFIFOSIZ11 register */
#define USB3_GTXFIFOSIZ11_TXFDEP_N_Pos                           0
#define USB3_GTXFIFOSIZ11_TXFDEP_N_Msk                           (0xffffUL << 0)
#define USB3_GTXFIFOSIZ11_TXFDEP_N                               (0xffffUL << 0)
#define USB3_GTXFIFOSIZ11_TXFSTADDR_N_Pos                        16
#define USB3_GTXFIFOSIZ11_TXFSTADDR_N_Msk                        (0xffffUL << 16)
#define USB3_GTXFIFOSIZ11_TXFSTADDR_N                            (0xffffUL << 16)

